
000100 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. variables.
000310 DATA DIVISION.
000320 WORKING-STORAGE SECTION.	
000340 77 nombre PIC X(6) value 'Felipe'.
000341 77 edad pic 9(2) value 26.
000400 PROCEDURE DIVISION.
000520 DISPLAY 'Tu nombre es ' nombre ' y tu edad es 'edad' años'.
000600 STOP RUN.
